app/services/proofing/aamva/request/templates/verify.xml.erb

<soap:Envelope
  xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
  xmlns:dldv="http://aamva.org/dldv/wsdl/2.1"
  xmlns:aa="http://aamva.org/niem/extensions/1.0"
  xmlns:nc="http://niem.gov/niem/niem-core/2.0">
  <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>http://aamva.org/dldv/wsdl/2.1/IDLDVService21/VerifyDriverLicenseData</wsa:Action>
  </soap:Header>
  <soap:Body>
    <dldv:VerifyDriverLicenseData>
      <dldv:token><%= auth_token %></dldv:token>
      <dldv:verifyDriverLicenseDataRequest>
        <aa:ControlData>
          <aa:MessageAddress>
            <aa:TransactionLocatorId><%= transaction_locator_id %></aa:TransactionLocatorId>
            <aa:MessageOriginatorId>GSA</aa:MessageOriginatorId>
            <aa:MessageDestinationId></aa:MessageDestinationId>
          </aa:MessageAddress>
        </aa:ControlData>
        <nc:DriverLicenseIdentification>
          <nc:IdentificationID xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="nc:PersonNameTextType"></nc:IdentificationID>
        </nc:DriverLicenseIdentification>
        <aa:PersonBirthDate></aa:PersonBirthDate>
        <nc:PersonName>
          <nc:PersonGivenName></nc:PersonGivenName>
          <nc:PersonSurName></nc:PersonSurName>
        </nc:PersonName>
        <aa:Address>
          <nc:AddressDeliveryPointText></nc:AddressDeliveryPointText>
          <nc:LocationCityName></nc:LocationCityName>
          <nc:LocationStateUsPostalServiceCode></nc:LocationStateUsPostalServiceCode>
          <nc:LocationPostalCode></nc:LocationPostalCode>
        </aa:Address>
      </dldv:verifyDriverLicenseDataRequest>
    </dldv:VerifyDriverLicenseData>
  </soap:Body>
</soap:Envelope>
